[
    {
        "index": 0,
        "title": "Passive Sniffing Mod",
        "text": "is a module presenting passive data interception in the network traffic. Properly configured and installed on the targeted computer, in the form of NET-TRAINER-ST device, it has the potential to go unnoticed for a prolonged period of time and conduct espionage on the connected network. In the case of complex device it should be brought up that passive data wiretapping can also be conducted through direct wired connection to the local network through hubs, routers, switches or the free 8P8C access points using the NET-TRAINER-ST adapter. This module allows detecting passwords going through the network from the wide range of protocols such as HTTP, TELNET, POP, FTP, SNMP, NNTP, MySQL, ICQ, SSH1, NFS, IRC, BGP, IMAP, SOCKS, RIP, SMB, X11, NAPSTER, ICQ, RLOGIN, LDAP and other common standards"
    },
    {
        "index": 1,
        "title": "ARP Mod",
        "text":"This module can be treated as an expanded function of the Passive Sniffing module, as a result of using the same Ettercap. However, in this case the whole network traffic, which NET-TRAINER-ST is being part of, is being monitored. This attack relies on NET-TRAINER-ST sending the falsified APR messages to the whole local network. As a result of this action, MAC address of the used device is paired to the IP address of the server in the network or other verified unit. Upon completing those activities, NET-TRAINER-ST begins receiving and filtering all data intended for aforementioned devices, which NET-TRAINER-ST impersonates. It should also be brought up, that this kind of attacks, not only serve to detect and steal classified information but are commonly used as basis to implement more complex attacks. More complicated attacks can exist on the grounds of ARP Spoofing, including denial-of-service attack - through redirecting a network traffic designated for many IP addresses to the given targeted unit MAC address, which in turn chokes and overloads said unit making it unresponsive and unable to work properly in the network, man-in-the-middle attack - modifying captured network traffic between victim units, session-hijacking - takeover of session identification, so as to give the attacker the access to the systems and applications as authorized individual."
    },
    {
        "index": 2,
        "title": "DNS Mod",
        "text": "Relies on implementation of falsified network traffic from the assailed computer. It is then an attack, that targets simultaneously one computer defining anew the inner host file located in the NET-TRAINER-ST, which all network traffic goes through. Host file is a configuration file, serving the purpose of mapping domain names with accordingly assigned IP addresses. The attack leans on changing the cached DNS records, so as to the request was redirected to the predefined malicious website, in which the attacker with ease could capture previously unavailable data. In this scenario of attack, the aforementioned malicious website would be the closest possible copy of the actual website, for example: the login page of the bank account or the social media such as Twitter, Facebook or Instagram. In the more advanced version of the attack, the created malicious website is often configured to pass the entered by user data to the actual, real website of said service. This means the user won't even notice theft of credentials that just took place."
    },
    {
        "index": 3,
        "title": "DNS Masq Mod",
        "text": "this module is quite similar to the 'DNS Mod' module, as a result of the preparatory activities before the launching of the module being the same. Meaning, the tester has to modify the /home/pi/mods/dns/hosts file on NET-TRAINER-ST device accordingly. After that is done, the module can be run from the main module menu. Furthermore, additional options given by DNSmasq server can be tested, which can be defined in the configuration file of the server. This file is located on the NET-TRAINER-ST device in '/etc/dnsmasq.conf'"
    },
    {
        "index": 4,
        "title": "Simple SSH",
        "text": "Uses the 'autossh' program to configure a backdoor that works by reverse-enabling the SSH communication protocol standard on the victim's device. This is a type of so-called reverse backdoor, however, with one difference: instead of configuring a listener, i.e. listening, the ssh protocol is enabled, allowing NET-TRAINER-ST to access the selected device through an additional user created. The module also has no problem implementing a more complex scenario using a virtual private server (VPS) to give an additional degree of anonymity to the attacking party. VPS is one of the methods used by cybercriminals to implement a very broad spectrum of attacks. With this solution, the attacker has access to all the necessary tools that are installed on the server. On the other hand, on the local device chosen by the attacker there is only a legitimate access client to the server.  WARNING! Requires setup on attacked target, refer to manual."
    },
    {
        "index": 5,
        "title": "Netcat BD",
        "text": "Is another backdoor module uses a fairly popular program called 'netcat' , a monitoring and scanning tool. This program was chosen because it is invoked without a graphical interface and can be easily scripted as part of more complex tasks. This tool is capable of reading and writing network connections - using protocols such as TCP and UDP. As with any other server, thanks to functionalities such as file transfer and port listening and scanning, it can be used precisely as a backdoor."
    },
    {
        "index": 6,
        "title": "TCP Metasploit",
        "text": "During the employment of this backdoor module, the multi handler available in the Metasploit tool is used. If the testing surrounding is placed in the home environment, using the standard Wi-Fi router, the port routing setting needs to be configured the same way as in Netcat BD module. After invoking the module, IP address of the targeted device, which has Metasploit installed, needs to be inputted. The same has to be done with port number, which the listening will take place. After those actions are completed, NET-TRAINER-ST is ready to work. Directly after, the tester should start listener service on his device. To accomplish that, Multi Handler (command: 'use exploit/multi/handler') should be executed in the Metasploit terminal, and then tester should invoke 'reverse tcp' attack through executing 'set payload python/meterpreter/reverse_tcp' command. At that moment, the only thing left to do is, through the help of correct commands, setting the local IP host: 'set lhost <local_IP>', and then port, on which the listening will proceed: 'set lport <chosen_port>'. At the end, tester executes simple command 'exploit', which commences listening a previously predefined connection with NET-TRAINER-ST, and as a result of that, after few seconds pass the freshly created backdoor can be used to control the target device."
    },
    {
        "index": 7,
        "title": "USB Power Only",
        "text": "Can be used when you don't want NET-TRAINER-ST to be used as a backdoor into a network. This module still allocated IP address to connected machine but the connection won't be bridged."
    },
    {
        "index": 8,
        "title": "Reset To Default",
        "text": "Disables currently active module and restarts the main NET-TRAINER-ST program."
    }
]